# AnalyticalModelSelector Constructor (AnalyticalCurveSelector) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalModelSelector Constructor (AnalyticalCurveSelector)
AnalyticalModelSelector Class See Also
---
Creates a selector for the analytical model geometry.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public AnalyticalModelSelector(
	AnalyticalCurveSelector inCurveSelector
)
```

Visual Basic
---
```text
Public Sub New ( _
	inCurveSelector As AnalyticalCurveSelector _
)
```

Visual C++
---
```text
public:
AnalyticalModelSelector(
	AnalyticalCurveSelector inCurveSelector
)
```

# ### Parameters
inCurveSelector
    Type: Autodesk.Revit.DB.Structure..::..AnalyticalCurveSelector Portion of the analytical curve in which the client has interest.
# Remarks
This version is useful for single-curve or single-point analytical models.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
AnalyticalModelSelector Class
AnalyticalModelSelector Overload
Autodesk.Revit.DB.Structure Namespace